# Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.

# string = input()
# count = 1
# for i in range(len(string)-1):
#     if i <= len(string):
#         if string[i] == string[i + 1]:
#             count += 1
#         else:
#             a = string[i]
#             print(count, string[i])
#             count = 1
# print(count, string[i])


# 38. Напишите программу, удаляющую из текста все слова, содержащие "абв".


# f = input().split()
# f1 =list(filter(lambda text:'а' not in text and 'б' not in text and 'с' not in text, f))
# print(f1)
